TXT_INSTRUCTION = ''' 
Данное приложение позволит вам с помощью теста Руфье \n провести первичную диагностику вашего здоровья.\n
Проба Руфье представляет собой нагрузочный комплекс, \n предназначенный для оценки работоспособности сердца при физической нагрузке.\n
У испытуемого определяют частоту пульса за 15 секунд.\n
Затем в течение 45 секунд испытуемый выполняет 30 приседаний.\n
После окончания нагрузки пульс подсчитывается вновь: \nчисло пульсаций за первые 15 секунд, 30 секунд отдыха,\n число пульсаций за последние 15 секунд.\n'''

TXT_SCR2_P1 = '''Замерьте пульс за 15 секунд.\n
Результат запишите в соответствующее поле.'''

TXT_SCR3_SITS = 'Выполните 30 приседаний за 45 секунд.'

TXT_SCR4_P2 = '''Выполните 30 приседаний за 45 секунд.\n 
Нажмите кнопку "Начать", чтобы запустить счетчик приседаний.\n
Делайте приседания со скоростью счетчика.'''

TXT_SCR4_P3 = '''В течение минуты замерьте пульс два раза:\n 
за первые 15 секунд минуты, затем за последние 15 секунд.\n
Результаты запишите в соответствующие поля.''' 


TXT_INDEX = "Ваш индекс Руфье: "
TXT_WORKHEART = "Работоспособность сердца: "

RES = {
    0: 'низкая.\nСрочно обратитесь к врачу!',
    1: 'удовлетворительная.\nОбратитесь к врачу!',
    2: 'средняя.\nВозможно, стоит дополнительно обследоваться у врача.',
    3: 'выше среднего',
    4: 'высокая',
}

GREEN = (0, 1, 0.17, 1)
DEFAULT = (1,1,1,0.2)
RED = (0.85, 0, 0, 1)
WHITE = (1,1,1,1)
BACKGROUND = (0.05, 0.07, 0.11, .95)


TIMER_P1 = 2 #15
TIMER_SITS = 2 #45
TIMER_P2 = 2 #15
TIMER_REST = 2 #30
TIMER_P3 = 2 #15
